{
  "publishedAt": "28th Jan 2022",
  "title": "RIGHT TOOL FOR THE JOB – POLYURETHANE SKIRTING",
  "content": "When I was a boy and worked with my father, he always told my brothers and me to use the right tool for the job. We quickly learned that when we didn’t, not only did we know it, but he could tell also.\n\nWhen it comes to keeping material on a conveyor belt without harming your equipment, the **Right Tool for the Job** is **[Polyurethane Belt Skirting](https://catalog.jamiesonequipment.com/category/all-categories-conveyor-products-skirting)**.\n\n[![](https://4putj38t9jw1tc3nu2czh1m4-wpengine.netdna-ssl.com/wp-content/uploads/rubber-skirting-before.png?w=300)](https://4putj38t9jw1tc3nu2czh1m4-wpengine.netdna-ssl.com/wp-content/uploads/rubber-skirting-before.png)**Before installing Polyurethane Skirting,** this customer was using **rubber “tire tread” type material** thinking this would be a wise, economical solution that would never wear out.\n\nThey did not realize that the solution they chose was not the “right tool for the job” until it wore the belting and leaked like a sieve. Because it was too tough and too difficult to trim, it wasn’t properly installed to seal all corners.\n\nIt would not be easy to measure the drag and stress that it had on the drive system, but the material was originally made for grip, thus the tread. This particular conveyor would spin/slip on the head pulley at start up and that’s how they were reminded to shovel the debris away from the tail pulley which was causing the spinning and slipping. Leakage is inevitable when the material is not right for the job. It’s important to have material that will wear just enough to conform to the belting application but is strong and durable enough to prevent premature wear.\n\n**Problem:**\n\n[![Product spillage](https://4putj38t9jw1tc3nu2czh1m4-wpengine.netdna-ssl.com/wp-content/uploads/product-spillage.jpg?w=221)](https://4putj38t9jw1tc3nu2czh1m4-wpengine.netdna-ssl.com/wp-content/uploads/product-spillage.jpg)Our customer was looking to find a better solution to the spillage waste and cleanup problem as well as diminish the cost of regularly replacing rubber skirting all of which increase labor and material costs.\n\nAdditionally, our customer had increased schedule shutdown costs due to increased maintenance and equipment damage to their rollers, belts, bearings, shaft, bushings, tail pulley, etc.",
  "featuredImage": "/images/uploads/m7.jpg"
}